#เครื่องมือคำนวนภาษีเบื้องต้น

'''
รายได้ 0-150,000 บาท ยกเว้นอัตราภาษี
รายได้ 150,001-300,000 บาท อัตราภาษี 5% ช่วง 150000
รายได้ 300,001-500,000 บาท อัตราภาษี 10% ช่วง 200000
รายได้ 500,001-750,000 บาท อัตราภาษี 15%  ช่วง 250000
รายได้ 750,001-1,000,000 บาท อัตราภาษี 20%  ช่วง 250000
รายได้ 1,000,001-2,000,000 บาท อัตราภาษี 25%  ช่วง 1000000
รายได้ 2,000,001-5,000,000 บาท อัตราภาษี 30% ช่วง 3000000
รายได้ 5,000,000 บาทขึ้นไป อัตราภาษี 35%

หัก ค่าใช้จ่าย 100,000
หัก ลดหย่อนส่วนบุคคล 60,000
'''

tax = int(input('ใส่จำนวนรายได้ของคุณ = '))
tax=tax-60000-100000 

print('รายได้หลักหักค่าใช้จ่ายและลดหย่อนของคุณเท่ากับ',tax,'บาท')
pay=0 #จำนวนเงินที่ต้องจ่าย


if tax<=150000: #0-150
  print('ไม่ต้องจ่ายภาษี')
else:

  
print('คุณจะต้องจ่ายภาษีทั้งสิ้น ', pay , 'บาท')
